espressif/esp-idf/components/soc/esp32/include/soc/slc_reg.h
#define SLC_1INT_ST_REG          (DR_REG_SLC_BASE + 0x18)
/* SLC_SLC1_TX_ERR_EOF_INT_ST : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_ERR_EOF_INT_ST  (BIT(24))
#define SLC_SLC1_TX_ERR_EOF_INT_ST_M  (BIT(24))
#define SLC_SLC1_TX_ERR_EOF_INT_ST_V  0x1
#define SLC_SLC1_TX_ERR_EOF_INT_ST_S  24
/* SLC_SLC1_WR_RETRY_DONE_INT_ST : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_WR_RETRY_DONE_INT_ST  (BIT(23))
#define SLC_SLC1_WR_RETRY_DONE_INT_ST_M  (BIT(23))
#define SLC_SLC1_WR_RETRY_DONE_INT_ST_V  0x1
#define SLC_SLC1_WR_RETRY_DONE_INT_ST_S  23
/* SLC_SLC1_HOST_RD_ACK_INT_ST : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_HOST_RD_ACK_INT_ST  (BIT(22))
#define SLC_SLC1_HOST_RD_ACK_INT_ST_M  (BIT(22))
#define SLC_SLC1_HOST_RD_ACK_INT_ST_V  0x1
#define SLC_SLC1_HOST_RD_ACK_INT_ST_S  22
/* SLC_SLC1_TX_DSCR_EMPTY_INT_ST : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_DSCR_EMPTY_INT_ST  (BIT(21))
#define SLC_SLC1_TX_DSCR_EMPTY_INT_ST_M  (BIT(21))
#define SLC_SLC1_TX_DSCR_EMPTY_INT_ST_V  0x1
#define SLC_SLC1_TX_DSCR_EMPTY_INT_ST_S  21
/* SLC_SLC1_RX_DSCR_ERR_INT_ST : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_DSCR_ERR_INT_ST  (BIT(20))
#define SLC_SLC1_RX_DSCR_ERR_INT_ST_M  (BIT(20))
#define SLC_SLC1_RX_DSCR_ERR_INT_ST_V  0x1
#define SLC_SLC1_RX_DSCR_ERR_INT_ST_S  20
/* SLC_SLC1_TX_DSCR_ERR_INT_ST : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_DSCR_ERR_INT_ST  (BIT(19))
#define SLC_SLC1_TX_DSCR_ERR_INT_ST_M  (BIT(19))
#define SLC_SLC1_TX_DSCR_ERR_INT_ST_V  0x1
#define SLC_SLC1_TX_DSCR_ERR_INT_ST_S  19
/* SLC_SLC1_TOHOST_INT_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOHOST_INT_ST  (BIT(18))
#define SLC_SLC1_TOHOST_INT_ST_M  (BIT(18))
#define SLC_SLC1_TOHOST_INT_ST_V  0x1
#define SLC_SLC1_TOHOST_INT_ST_S  18
/* SLC_SLC1_RX_EOF_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_EOF_INT_ST  (BIT(17))
#define SLC_SLC1_RX_EOF_INT_ST_M  (BIT(17))
#define SLC_SLC1_RX_EOF_INT_ST_V  0x1
#define SLC_SLC1_RX_EOF_INT_ST_S  17
/* SLC_SLC1_RX_DONE_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_DONE_INT_ST  (BIT(16))
#define SLC_SLC1_RX_DONE_INT_ST_M  (BIT(16))
#define SLC_SLC1_RX_DONE_INT_ST_V  0x1
#define SLC_SLC1_RX_DONE_INT_ST_S  16
/* SLC_SLC1_TX_SUC_EOF_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_SUC_EOF_INT_ST  (BIT(15))
#define SLC_SLC1_TX_SUC_EOF_INT_ST_M  (BIT(15))
#define SLC_SLC1_TX_SUC_EOF_INT_ST_V  0x1
#define SLC_SLC1_TX_SUC_EOF_INT_ST_S  15
/* SLC_SLC1_TX_DONE_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_DONE_INT_ST  (BIT(14))
#define SLC_SLC1_TX_DONE_INT_ST_M  (BIT(14))
#define SLC_SLC1_TX_DONE_INT_ST_V  0x1
#define SLC_SLC1_TX_DONE_INT_ST_S  14
/* SLC_SLC1_TOKEN1_1TO0_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN1_1TO0_INT_ST  (BIT(13))
#define SLC_SLC1_TOKEN1_1TO0_INT_ST_M  (BIT(13))
#define SLC_SLC1_TOKEN1_1TO0_INT_ST_V  0x1
#define SLC_SLC1_TOKEN1_1TO0_INT_ST_S  13
/* SLC_SLC1_TOKEN0_1TO0_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN0_1TO0_INT_ST  (BIT(12))
#define SLC_SLC1_TOKEN0_1TO0_INT_ST_M  (BIT(12))
#define SLC_SLC1_TOKEN0_1TO0_INT_ST_V  0x1
#define SLC_SLC1_TOKEN0_1TO0_INT_ST_S  12
/* SLC_SLC1_TX_OVF_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_OVF_INT_ST  (BIT(11))
#define SLC_SLC1_TX_OVF_INT_ST_M  (BIT(11))
#define SLC_SLC1_TX_OVF_INT_ST_V  0x1
#define SLC_SLC1_TX_OVF_INT_ST_S  11
/* SLC_SLC1_RX_UDF_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_UDF_INT_ST  (BIT(10))
#define SLC_SLC1_RX_UDF_INT_ST_M  (BIT(10))
#define SLC_SLC1_RX_UDF_INT_ST_V  0x1
#define SLC_SLC1_RX_UDF_INT_ST_S  10
/* SLC_SLC1_TX_START_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_START_INT_ST  (BIT(9))
#define SLC_SLC1_TX_START_INT_ST_M  (BIT(9))
#define SLC_SLC1_TX_START_INT_ST_V  0x1
#define SLC_SLC1_TX_START_INT_ST_S  9
/* SLC_SLC1_RX_START_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_START_INT_ST  (BIT(8))
#define SLC_SLC1_RX_START_INT_ST_M  (BIT(8))
#define SLC_SLC1_RX_START_INT_ST_V  0x1
#define SLC_SLC1_RX_START_INT_ST_S  8
/* SLC_FRHOST_BIT15_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT15_INT_ST  (BIT(7))
#define SLC_FRHOST_BIT15_INT_ST_M  (BIT(7))
#define SLC_FRHOST_BIT15_INT_ST_V  0x1
#define SLC_FRHOST_BIT15_INT_ST_S  7
/* SLC_FRHOST_BIT14_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT14_INT_ST  (BIT(6))
#define SLC_FRHOST_BIT14_INT_ST_M  (BIT(6))
#define SLC_FRHOST_BIT14_INT_ST_V  0x1
#define SLC_FRHOST_BIT14_INT_ST_S  6
/* SLC_FRHOST_BIT13_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT13_INT_ST  (BIT(5))
#define SLC_FRHOST_BIT13_INT_ST_M  (BIT(5))
#define SLC_FRHOST_BIT13_INT_ST_V  0x1
#define SLC_FRHOST_BIT13_INT_ST_S  5
/* SLC_FRHOST_BIT12_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT12_INT_ST  (BIT(4))
#define SLC_FRHOST_BIT12_INT_ST_M  (BIT(4))
#define SLC_FRHOST_BIT12_INT_ST_V  0x1
#define SLC_FRHOST_BIT12_INT_ST_S  4
/* SLC_FRHOST_BIT11_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT11_INT_ST  (BIT(3))
#define SLC_FRHOST_BIT11_INT_ST_M  (BIT(3))
#define SLC_FRHOST_BIT11_INT_ST_V  0x1
#define SLC_FRHOST_BIT11_INT_ST_S  3
/* SLC_FRHOST_BIT10_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT10_INT_ST  (BIT(2))
#define SLC_FRHOST_BIT10_INT_ST_M  (BIT(2))
#define SLC_FRHOST_BIT10_INT_ST_V  0x1
#define SLC_FRHOST_BIT10_INT_ST_S  2
/* SLC_FRHOST_BIT9_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT9_INT_ST  (BIT(1))
#define SLC_FRHOST_BIT9_INT_ST_M  (BIT(1))
#define SLC_FRHOST_BIT9_INT_ST_V  0x1
#define SLC_FRHOST_BIT9_INT_ST_S  1
/* SLC_FRHOST_BIT8_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT8_INT_ST  (BIT(0))
#define SLC_FRHOST_BIT8_INT_ST_M  (BIT(0))
#define SLC_FRHOST_BIT8_INT_ST_V  0x1
#define SLC_FRHOST_BIT8_INT_ST_S  0

#define SLC_1INT_ENA_REG          (DR_REG_SLC_BASE + 0x1C)
/* SLC_SLC1_TX_ERR_EOF_INT_ENA : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_ERR_EOF_INT_ENA  (BIT(24))
#define SLC_SLC1_TX_ERR_EOF_INT_ENA_M  (BIT(24))
#define SLC_SLC1_TX_ERR_EOF_INT_ENA_V  0x1
#define SLC_SLC1_TX_ERR_EOF_INT_ENA_S  24
/* SLC_SLC1_WR_RETRY_DONE_INT_ENA : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_WR_RETRY_DONE_INT_ENA  (BIT(23))
#define SLC_SLC1_WR_RETRY_DONE_INT_ENA_M  (BIT(23))
#define SLC_SLC1_WR_RETRY_DONE_INT_ENA_V  0x1
#define SLC_SLC1_WR_RETRY_DONE_INT_ENA_S  23
/* SLC_SLC1_HOST_RD_ACK_INT_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_HOST_RD_ACK_INT_ENA  (BIT(22))
#define SLC_SLC1_HOST_RD_ACK_INT_ENA_M  (BIT(22))
#define SLC_SLC1_HOST_RD_ACK_INT_ENA_V  0x1
#define SLC_SLC1_HOST_RD_ACK_INT_ENA_S  22
/* SLC_SLC1_TX_DSCR_EMPTY_INT_ENA : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_DSCR_EMPTY_INT_ENA  (BIT(21))
#define SLC_SLC1_TX_DSCR_EMPTY_INT_ENA_M  (BIT(21))
#define SLC_SLC1_TX_DSCR_EMPTY_INT_ENA_V  0x1
#define SLC_SLC1_TX_DSCR_EMPTY_INT_ENA_S  21
/* SLC_SLC1_RX_DSCR_ERR_INT_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_DSCR_ERR_INT_ENA  (BIT(20))
#define SLC_SLC1_RX_DSCR_ERR_INT_ENA_M  (BIT(20))
#define SLC_SLC1_RX_DSCR_ERR_INT_ENA_V  0x1
#define SLC_SLC1_RX_DSCR_ERR_INT_ENA_S  20
/* SLC_SLC1_TX_DSCR_ERR_INT_ENA : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_DSCR_ERR_INT_ENA  (BIT(19))
#define SLC_SLC1_TX_DSCR_ERR_INT_ENA_M  (BIT(19))
#define SLC_SLC1_TX_DSCR_ERR_INT_ENA_V  0x1
#define SLC_SLC1_TX_DSCR_ERR_INT_ENA_S  19
/* SLC_SLC1_TOHOST_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOHOST_INT_ENA  (BIT(18))
#define SLC_SLC1_TOHOST_INT_ENA_M  (BIT(18))
#define SLC_SLC1_TOHOST_INT_ENA_V  0x1
#define SLC_SLC1_TOHOST_INT_ENA_S  18
/* SLC_SLC1_RX_EOF_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_EOF_INT_ENA  (BIT(17))
#define SLC_SLC1_RX_EOF_INT_ENA_M  (BIT(17))
#define SLC_SLC1_RX_EOF_INT_ENA_V  0x1
#define SLC_SLC1_RX_EOF_INT_ENA_S  17
/* SLC_SLC1_RX_DONE_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_DONE_INT_ENA  (BIT(16))
#define SLC_SLC1_RX_DONE_INT_ENA_M  (BIT(16))
#define SLC_SLC1_RX_DONE_INT_ENA_V  0x1
#define SLC_SLC1_RX_DONE_INT_ENA_S  16
/* SLC_SLC1_TX_SUC_EOF_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_SUC_EOF_INT_ENA  (BIT(15))
#define SLC_SLC1_TX_SUC_EOF_INT_ENA_M  (BIT(15))
#define SLC_SLC1_TX_SUC_EOF_INT_ENA_V  0x1
#define SLC_SLC1_TX_SUC_EOF_INT_ENA_S  15
/* SLC_SLC1_TX_DONE_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_DONE_INT_ENA  (BIT(14))
#define SLC_SLC1_TX_DONE_INT_ENA_M  (BIT(14))
#define SLC_SLC1_TX_DONE_INT_ENA_V  0x1
#define SLC_SLC1_TX_DONE_INT_ENA_S  14
/* SLC_SLC1_TOKEN1_1TO0_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN1_1TO0_INT_ENA  (BIT(13))
#define SLC_SLC1_TOKEN1_1TO0_INT_ENA_M  (BIT(13))
#define SLC_SLC1_TOKEN1_1TO0_INT_ENA_V  0x1
#define SLC_SLC1_TOKEN1_1TO0_INT_ENA_S  13
/* SLC_SLC1_TOKEN0_1TO0_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN0_1TO0_INT_ENA  (BIT(12))
#define SLC_SLC1_TOKEN0_1TO0_INT_ENA_M  (BIT(12))
#define SLC_SLC1_TOKEN0_1TO0_INT_ENA_V  0x1
#define SLC_SLC1_TOKEN0_1TO0_INT_ENA_S  12
/* SLC_SLC1_TX_OVF_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_OVF_INT_ENA  (BIT(11))
#define SLC_SLC1_TX_OVF_INT_ENA_M  (BIT(11))
#define SLC_SLC1_TX_OVF_INT_ENA_V  0x1
#define SLC_SLC1_TX_OVF_INT_ENA_S  11
/* SLC_SLC1_RX_UDF_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_UDF_INT_ENA  (BIT(10))
#define SLC_SLC1_RX_UDF_INT_ENA_M  (BIT(10))
#define SLC_SLC1_RX_UDF_INT_ENA_V  0x1
#define SLC_SLC1_RX_UDF_INT_ENA_S  10
/* SLC_SLC1_TX_START_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_START_INT_ENA  (BIT(9))
#define SLC_SLC1_TX_START_INT_ENA_M  (BIT(9))
#define SLC_SLC1_TX_START_INT_ENA_V  0x1
#define SLC_SLC1_TX_START_INT_ENA_S  9
/* SLC_SLC1_RX_START_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_START_INT_ENA  (BIT(8))
#define SLC_SLC1_RX_START_INT_ENA_M  (BIT(8))
#define SLC_SLC1_RX_START_INT_ENA_V  0x1
#define SLC_SLC1_RX_START_INT_ENA_S  8
/* SLC_FRHOST_BIT15_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT15_INT_ENA  (BIT(7))
#define SLC_FRHOST_BIT15_INT_ENA_M  (BIT(7))
#define SLC_FRHOST_BIT15_INT_ENA_V  0x1
#define SLC_FRHOST_BIT15_INT_ENA_S  7
/* SLC_FRHOST_BIT14_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT14_INT_ENA  (BIT(6))
#define SLC_FRHOST_BIT14_INT_ENA_M  (BIT(6))
#define SLC_FRHOST_BIT14_INT_ENA_V  0x1
#define SLC_FRHOST_BIT14_INT_ENA_S  6
/* SLC_FRHOST_BIT13_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT13_INT_ENA  (BIT(5))
#define SLC_FRHOST_BIT13_INT_ENA_M  (BIT(5))
#define SLC_FRHOST_BIT13_INT_ENA_V  0x1
#define SLC_FRHOST_BIT13_INT_ENA_S  5
/* SLC_FRHOST_BIT12_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT12_INT_ENA  (BIT(4))
#define SLC_FRHOST_BIT12_INT_ENA_M  (BIT(4))
#define SLC_FRHOST_BIT12_INT_ENA_V  0x1
#define SLC_FRHOST_BIT12_INT_ENA_S  4
/* SLC_FRHOST_BIT11_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT11_INT_ENA  (BIT(3))
#define SLC_FRHOST_BIT11_INT_ENA_M  (BIT(3))
#define SLC_FRHOST_BIT11_INT_ENA_V  0x1
#define SLC_FRHOST_BIT11_INT_ENA_S  3
/* SLC_FRHOST_BIT10_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT10_INT_ENA  (BIT(2))
#define SLC_FRHOST_BIT10_INT_ENA_M  (BIT(2))
#define SLC_FRHOST_BIT10_INT_ENA_V  0x1
#define SLC_FRHOST_BIT10_INT_ENA_S  2
/* SLC_FRHOST_BIT9_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT9_INT_ENA  (BIT(1))
#define SLC_FRHOST_BIT9_INT_ENA_M  (BIT(1))
#define SLC_FRHOST_BIT9_INT_ENA_V  0x1
#define SLC_FRHOST_BIT9_INT_ENA_S  1
/* SLC_FRHOST_BIT8_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT8_INT_ENA  (BIT(0))
#define SLC_FRHOST_BIT8_INT_ENA_M  (BIT(0))
#define SLC_FRHOST_BIT8_INT_ENA_V  0x1
#define SLC_FRHOST_BIT8_INT_ENA_S  0

