espressif/esp-idf/components/soc/esp32/include/soc/slc_reg.h
#define SLC_1_TX_ERREOF_DES_ADDR_REG          (DR_REG_SLC_BASE + 0xD0)
/* SLC_SLC1_TX_ERR_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC1_TX_ERR_EOF_DES_ADDR  0xFFFFFFFF
#define SLC_SLC1_TX_ERR_EOF_DES_ADDR_M  ((SLC_SLC1_TX_ERR_EOF_DES_ADDR_V)<<(SLC_SLC1_TX_ERR_EOF_DES_ADDR_S))
#define SLC_SLC1_TX_ERR_EOF_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC1_TX_ERR_EOF_DES_ADDR_S  0

#define SLC_TOKEN_LAT_REG          (DR_REG_SLC_BASE + 0xD4)
/* SLC_SLC1_TOKEN : RO ;bitpos:[27:16] ;default: 12'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN  0x00000FFF
#define SLC_SLC1_TOKEN_M  ((SLC_SLC1_TOKEN_V)<<(SLC_SLC1_TOKEN_S))
#define SLC_SLC1_TOKEN_V  0xFFF
#define SLC_SLC1_TOKEN_S  16
/* SLC_SLC0_TOKEN : RO ;bitpos:[11:0] ;default: 12'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN  0x00000FFF
#define SLC_SLC0_TOKEN_M  ((SLC_SLC0_TOKEN_V)<<(SLC_SLC0_TOKEN_S))
#define SLC_SLC0_TOKEN_V  0xFFF
#define SLC_SLC0_TOKEN_S  0

#define SLC_TX_DSCR_CONF_REG          (DR_REG_SLC_BASE + 0xD8)
/* SLC_WR_RETRY_THRESHOLD : R/W ;bitpos:[10:0] ;default: 11'h80 ; */
/*description: */
#define SLC_WR_RETRY_THRESHOLD  0x000007FF
#define SLC_WR_RETRY_THRESHOLD_M  ((SLC_WR_RETRY_THRESHOLD_V)<<(SLC_WR_RETRY_THRESHOLD_S))
#define SLC_WR_RETRY_THRESHOLD_V  0x7FF
#define SLC_WR_RETRY_THRESHOLD_S  0

#define SLC_CMD_INFOR0_REG          (DR_REG_SLC_BASE + 0xDC)
/* SLC_CMD_CONTENT0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_CMD_CONTENT0  0xFFFFFFFF
#define SLC_CMD_CONTENT0_M  ((SLC_CMD_CONTENT0_V)<<(SLC_CMD_CONTENT0_S))
#define SLC_CMD_CONTENT0_V  0xFFFFFFFF
#define SLC_CMD_CONTENT0_S  0

#define SLC_CMD_INFOR1_REG          (DR_REG_SLC_BASE + 0xE0)
/* SLC_CMD_CONTENT1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_CMD_CONTENT1  0xFFFFFFFF
#define SLC_CMD_CONTENT1_M  ((SLC_CMD_CONTENT1_V)<<(SLC_CMD_CONTENT1_S))
#define SLC_CMD_CONTENT1_V  0xFFFFFFFF
#define SLC_CMD_CONTENT1_S  0

#define SLC_0_LEN_CONF_REG          (DR_REG_SLC_BASE + 0xE4)
/* SLC_SLC0_TX_NEW_PKT_IND : RO ;bitpos:[28] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_NEW_PKT_IND  (BIT(28))
#define SLC_SLC0_TX_NEW_PKT_IND_M  (BIT(28))
#define SLC_SLC0_TX_NEW_PKT_IND_V  0x1
#define SLC_SLC0_TX_NEW_PKT_IND_S  28
/* SLC_SLC0_RX_NEW_PKT_IND : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_NEW_PKT_IND  (BIT(27))
#define SLC_SLC0_RX_NEW_PKT_IND_M  (BIT(27))
#define SLC_SLC0_RX_NEW_PKT_IND_V  0x1
#define SLC_SLC0_RX_NEW_PKT_IND_S  27
/* SLC_SLC0_TX_GET_USED_DSCR : WO ;bitpos:[26] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_GET_USED_DSCR  (BIT(26))
#define SLC_SLC0_TX_GET_USED_DSCR_M  (BIT(26))
#define SLC_SLC0_TX_GET_USED_DSCR_V  0x1
#define SLC_SLC0_TX_GET_USED_DSCR_S  26
/* SLC_SLC0_RX_GET_USED_DSCR : WO ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_GET_USED_DSCR  (BIT(25))
#define SLC_SLC0_RX_GET_USED_DSCR_M  (BIT(25))
#define SLC_SLC0_RX_GET_USED_DSCR_V  0x1
#define SLC_SLC0_RX_GET_USED_DSCR_S  25
/* SLC_SLC0_TX_PACKET_LOAD_EN : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_PACKET_LOAD_EN  (BIT(24))
#define SLC_SLC0_TX_PACKET_LOAD_EN_M  (BIT(24))
#define SLC_SLC0_TX_PACKET_LOAD_EN_V  0x1
#define SLC_SLC0_TX_PACKET_LOAD_EN_S  24
/* SLC_SLC0_RX_PACKET_LOAD_EN : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_PACKET_LOAD_EN  (BIT(23))
#define SLC_SLC0_RX_PACKET_LOAD_EN_M  (BIT(23))
#define SLC_SLC0_RX_PACKET_LOAD_EN_V  0x1
#define SLC_SLC0_RX_PACKET_LOAD_EN_S  23
/* SLC_SLC0_LEN_INC_MORE : WO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_LEN_INC_MORE  (BIT(22))
#define SLC_SLC0_LEN_INC_MORE_M  (BIT(22))
#define SLC_SLC0_LEN_INC_MORE_V  0x1
#define SLC_SLC0_LEN_INC_MORE_S  22
/* SLC_SLC0_LEN_INC : WO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_LEN_INC  (BIT(21))
#define SLC_SLC0_LEN_INC_M  (BIT(21))
#define SLC_SLC0_LEN_INC_V  0x1
#define SLC_SLC0_LEN_INC_S  21
/* SLC_SLC0_LEN_WR : WO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_LEN_WR  (BIT(20))
#define SLC_SLC0_LEN_WR_M  (BIT(20))
#define SLC_SLC0_LEN_WR_V  0x1
#define SLC_SLC0_LEN_WR_S  20
/* SLC_SLC0_LEN_WDATA : WO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define SLC_SLC0_LEN_WDATA  0x000FFFFF
#define SLC_SLC0_LEN_WDATA_M  ((SLC_SLC0_LEN_WDATA_V)<<(SLC_SLC0_LEN_WDATA_S))
#define SLC_SLC0_LEN_WDATA_V  0xFFFFF
#define SLC_SLC0_LEN_WDATA_S  0

#define SLC_0_LENGTH_REG          (DR_REG_SLC_BASE + 0xE8)
/* SLC_SLC0_LEN : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define SLC_SLC0_LEN  0x000FFFFF
#define SLC_SLC0_LEN_M  ((SLC_SLC0_LEN_V)<<(SLC_SLC0_LEN_S))
#define SLC_SLC0_LEN_V  0xFFFFF
#define SLC_SLC0_LEN_S  0

#define SLC_0_TXPKT_H_DSCR_REG          (DR_REG_SLC_BASE + 0xEC)
/* SLC_SLC0_TX_PKT_H_DSCR_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC0_TX_PKT_H_DSCR_ADDR  0xFFFFFFFF
#define SLC_SLC0_TX_PKT_H_DSCR_ADDR_M  ((SLC_SLC0_TX_PKT_H_DSCR_ADDR_V)<<(SLC_SLC0_TX_PKT_H_DSCR_ADDR_S))
#define SLC_SLC0_TX_PKT_H_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TX_PKT_H_DSCR_ADDR_S  0

#define SLC_0_TXPKT_E_DSCR_REG          (DR_REG_SLC_BASE + 0xF0)
/* SLC_SLC0_TX_PKT_E_DSCR_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC0_TX_PKT_E_DSCR_ADDR  0xFFFFFFFF
#define SLC_SLC0_TX_PKT_E_DSCR_ADDR_M  ((SLC_SLC0_TX_PKT_E_DSCR_ADDR_V)<<(SLC_SLC0_TX_PKT_E_DSCR_ADDR_S))
#define SLC_SLC0_TX_PKT_E_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TX_PKT_E_DSCR_ADDR_S  0

#define SLC_0_RXPKT_H_DSCR_REG          (DR_REG_SLC_BASE + 0xF4)
/* SLC_SLC0_RX_PKT_H_DSCR_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC0_RX_PKT_H_DSCR_ADDR  0xFFFFFFFF
#define SLC_SLC0_RX_PKT_H_DSCR_ADDR_M  ((SLC_SLC0_RX_PKT_H_DSCR_ADDR_V)<<(SLC_SLC0_RX_PKT_H_DSCR_ADDR_S))
#define SLC_SLC0_RX_PKT_H_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_RX_PKT_H_DSCR_ADDR_S  0

#define SLC_0_RXPKT_E_DSCR_REG          (DR_REG_SLC_BASE + 0xF8)
/* SLC_SLC0_RX_PKT_E_DSCR_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC0_RX_PKT_E_DSCR_ADDR  0xFFFFFFFF
#define SLC_SLC0_RX_PKT_E_DSCR_ADDR_M  ((SLC_SLC0_RX_PKT_E_DSCR_ADDR_V)<<(SLC_SLC0_RX_PKT_E_DSCR_ADDR_S))
#define SLC_SLC0_RX_PKT_E_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_RX_PKT_E_DSCR_ADDR_S  0

#define SLC_0_TXPKTU_H_DSCR_REG          (DR_REG_SLC_BASE + 0xFC)
/* SLC_SLC0_TX_PKT_START_DSCR_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC0_TX_PKT_START_DSCR_ADDR  0xFFFFFFFF
#define SLC_SLC0_TX_PKT_START_DSCR_ADDR_M  ((SLC_SLC0_TX_PKT_START_DSCR_ADDR_V)<<(SLC_SLC0_TX_PKT_START_DSCR_ADDR_S))
#define SLC_SLC0_TX_PKT_START_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TX_PKT_START_DSCR_ADDR_S  0

